app/controllers/buyer_informations_controller.rb

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
---
  def set_item
    @item = Item.find(params[:item_id])