app/controllers/items_controller.rb

SELECT `items`.* FROM `items` ORDER BY created_at DESC
---
    def index
         @items = Item.all.order("created_at DESC")

INSERT INTO `items` (`product_name`, `product_description`, `category_id`, `user_id`, `product_condition_id`, `shipping_charge_id`, `shipping_area_id`, `days_to_ship_id`, `selling_price`, `created_at`, `updated_at`) VALUES ('a', 'a', 2, 1, 2, 2, 2, 3, 10000, '2020-12-17 03:16:30.904160', '2020-12-17 03:16:30.904160')
---
     def create
        @item = Item.new(item_params)
        if @item.save

SELECT `items`.* FROM `items` WHERE `items`.`id` = 3 LIMIT 1
---
      def show
        @item = Item.find(params[:id])

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
---
      def edit
        @item = Item.find(params[:id])

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
UPDATE `items` SET `items`.`product_name` = 'aa', `items`.`updated_at` = '2020-12-18 08:09:41.091944' WHERE `items`.`id` = 1
---
      def update
        item = Item.find(params[:id])
        item.update(item_params)

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
---
      def destroy
        item = Item.find(params[:id])