app/controllers/items_controller.rb

DELETE FROM `items` WHERE `items`.`id` = 1
---
      def destroy
        if current_user != @item.user
          redirect_to root_path
        end
          @item.destroy