app/controllers/prototypes_controller.rb

SELECT `prototypes`.* FROM `prototypes`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)
---
  def index
    @prototypes = Prototype.includes(:user)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 6 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 6
---
  def destroy
    prototype = Prototype.find(params[:id])
    prototype.destroy

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 13 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`catch_copy` = 'done', `prototypes`.`concept` = 'done', `prototypes`.`updated_at` = '2020-12-02 09:01:48.745845' WHERE `prototypes`.`id` = 13
---
  def update
    @prototype = Prototype.find(params[:id])
    if @prototype.update(prototype_params)

SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)
---
  def show
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)