app/models/buyer_information.rb

  def save
    purchase_information = PurchaseInformation.create(user_id: user_id, item_id: item_id)
    Address.create(postal_code: postal_code, shipping_area_id: shipping_area_id, municipalities: municipalities, address: address, building_name: building_name, phone_number: phone_number, purchase_information_id: purchase_information.id)
---
INSERT INTO `addresses` (`postal_code`, `shipping_area_id`, `municipalities`, `address`, `building_name`, `phone_number`, `purchase_information_id`, `created_at`, `updated_at`) VALUES ('123-1234', 2, '札幌市', '札幌市1-1-1', '', '09011112222', 1, '2020-12-21 10:10:00.276261', '2020-12-21 10:10:00.276261')
INSERT INTO `purchase_informations` (`user_id`, `item_id`, `created_at`, `updated_at`) VALUES (2, 2, '2020-12-21 10:10:00.256329', '2020-12-21 10:10:00.256329')